from abc import ABC, abstractmethod
import os


class TitleScreen(ABC):
    @abstractmethod
    def display(self):
        pass

class SimpleTitle(TitleScreen):
    def display(self):
        print("=== WARRIOR-BOT ===")


class FancyTitle(TitleScreen):
    def display(self):
        print(r"""
██╗    ██╗ █████╗ ██████╗ ██████╗ ██╗ ██████╗ ██████╗      ██████╗  ██████╗ ████████╗
██║    ██║██╔══██╗██╔══██╗██╔══██╗██║██╔═══██╗██╔══██╗     ██╔══██╗██╔═══██╗╚══██╔══╝
██║ █╗ ██║███████║██████╔╝██████╔╝██║██║   ██║██████╔╝     ██████╔╝██║   ██║   ██║   
██║███╗██║██╔══██║██╔══██╗██╔══██╗██║██║   ██║██╔══██╗     ██╔══██╗██║   ██║   ██║   
╚███╔███╔╝██║  ██║██║  ██║██║  ██║██║╚██████╔╝██║  ██║     ██████╔╝╚██████╔╝   ██║   
 ╚══╝╚══╝ ╚═╝  ╚═╝╚═╝  ╚═╝╚═╝  ╚═╝╚═╝ ╚═════╝ ╚═╝  ╚═╝     ╚═════╝  ╚═════╝    ╚═╝   
        """)



class TitleFactory:
    @staticmethod
    def create_title(style):
        if style.lower() == "simple":
            return SimpleTitle()
        elif style.lower() == "fancy":
            return FancyTitle()
        else:
            raise ValueError("Unknown style type.")



def clear_screen():
    os.system('cls' if os.name == 'nt' else 'clear')


def main():
    clear_screen()

    title = TitleFactory.create_title("fancy")
    title.display()

    input("\nPress Enter to start Warrior-Bot...")



if __name__ == "__main__":
    main()